/* automatically generated by rust-bindgen */

pub const PF_UNSPEC: u32 = 0;
pub const PF_LOCAL: u32 = 1;
pub const PF_UNIX: u32 = 1;
pub const PF_INET: u32 = 2;
pub const PF_IMPLINK: u32 = 3;
pub const PF_PUP: u32 = 4;
pub const PF_CHAOS: u32 = 5;
pub const PF_NS: u32 = 6;
pub const PF_ISO: u32 = 7;
pub const PF_OSI: u32 = 7;
pub const PF_ECMA: u32 = 8;
pub const PF_DATAKIT: u32 = 9;
pub const PF_CCITT: u32 = 10;
pub const PF_SNA: u32 = 11;
pub const PF_DECnet: u32 = 12;
pub const PF_DLI: u32 = 13;
pub const PF_LAT: u32 = 14;
pub const PF_HYLINK: u32 = 15;
pub const PF_APPLETALK: u32 = 16;
pub const PF_ROUTE: u32 = 17;
pub const PF_LINK: u32 = 18;
pub const PF_XTP: u32 = 19;
pub const PF_COIP: u32 = 20;
pub const PF_CNT: u32 = 21;
pub const PF_SIP: u32 = 24;
pub const PF_IPX: u32 = 23;
pub const PF_RTIP: u32 = 22;
pub const PF_PIP: u32 = 25;
pub const PF_NDRV: u32 = 27;
pub const PF_ISDN: u32 = 28;
pub const PF_KEY: u32 = 29;
pub const PF_INET6: u32 = 30;
pub const PF_NATM: u32 = 31;
pub const PF_SYSTEM: u32 = 32;
pub const PF_NETBIOS: u32 = 33;
pub const PF_PPP: u32 = 34;
pub const PF_RESERVED_36: u32 = 36;
pub const PF_UTUN: u32 = 38;
pub const PF_MAX: u32 = 40;
pub const PF_MD5_DIGEST_LENGTH: u32 = 16;
pub const PF_GRE_PPTP_VARIANT: u32 = 1;
pub const PF_POOL_IDMASK: u32 = 15;
pub const PF_POOL_TYPEMASK: u32 = 15;
pub const PF_POOL_STICKYADDR: u32 = 32;
pub const PF_WSCALE_FLAG: u32 = 128;
pub const PF_WSCALE_MASK: u32 = 15;
pub const PF_LOG: u32 = 1;

pub const PF_OSFP_MSS_MOD: u32 = 1024;
pub const PF_OSFP_MSS_DC: u32 = 2048;
pub const PF_OSFP_DF: u32 = 4096;
pub const PF_OSFP_TS0: u32 = 8192;
pub const PF_OSFP_INET6: u32 = 16384;
pub const PF_OSFP_MAXTTL_OFFSET: u32 = 40;
pub const PF_OSFP_TCPOPT_NOP: u32 = 0;
pub const PF_OSFP_TCPOPT_WSCALE: u32 = 1;
pub const PF_OSFP_TCPOPT_MSS: u32 = 2;
pub const PF_OSFP_TCPOPT_SACK: u32 = 3;
pub const PF_OSFP_TCPOPT_TS: u32 = 4;
pub const PF_OSFP_TCPOPT_BITS: u32 = 3;
pub const PF_ANCHOR_NAME_SIZE: u32 = 64;
pub const PF_SKIP_IFP: u32 = 0;
pub const PF_SKIP_DIR: u32 = 1;
pub const PF_SKIP_AF: u32 = 2;
pub const PF_SKIP_PROTO: u32 = 3;
pub const PF_SKIP_SRC_ADDR: u32 = 4;
pub const PF_SKIP_SRC_PORT: u32 = 5;
pub const PF_SKIP_DST_ADDR: u32 = 6;
pub const PF_SKIP_DST_PORT: u32 = 7;
pub const PF_SKIP_COUNT: u32 = 8;
pub const PF_RULE_LABEL_SIZE: u32 = 64;
pub const PF_QNAME_SIZE: u32 = 64;
pub const PF_TAG_NAME_SIZE: u32 = 64;
pub const PF_OWNER_NAME_SIZE: u32 = 64;
pub const PF_STATE_NORMAL: u32 = 1;
pub const PF_STATE_MODULATE: u32 = 2;
pub const PF_STATE_SYNPROXY: u32 = 3;
pub const PF_FLUSH: u32 = 1;
pub const PF_FLUSH_GLOBAL: u32 = 2;
pub const PFRULE_DROP: u32 = 0;
pub const PFRULE_RETURNRST: u32 = 1;
pub const PFRULE_FRAGMENT: u32 = 2;
pub const PFRULE_RETURNICMP: u32 = 4;
pub const PFRULE_RETURN: u32 = 8;
pub const PFRULE_NOSYNC: u32 = 16;
pub const PFRULE_SRCTRACK: u32 = 32;
pub const PFRULE_RULESRCTRACK: u32 = 64;
pub const PFRULE_NODF: u32 = 256;
pub const PFRULE_FRAGCROP: u32 = 512;
pub const PFRULE_FRAGDROP: u32 = 1024;
pub const PFRULE_RANDOMID: u32 = 2048;
pub const PFRULE_REASSEMBLE_TCP: u32 = 4096;
pub const PFRULE_TOS: u32 = 8192;
pub const PFRULE_DSCP: u32 = 16384;
pub const PFRULE_SC: u32 = 32768;
pub const PFRULE_IFBOUND: u32 = 65536;
pub const PFRULE_PFM: u32 = 131072;
pub const PF_THRESHOLD_MULT: u32 = 1000;
pub const PF_THRESHOLD_MAX: u32 = 4294967;
pub const PF_RESERVED_ANCHOR: &'static [u8; 4usize] = b"_pf\0";
pub const PF_DPORT_RANGE: u32 = 1;
pub const PF_RPORT_RANGE: u32 = 2;
pub const PF_ALTQ_BW_ABSOLUTE: u32 = 1;
pub const PF_ALTQ_BW_PERCENT: u32 = 2;
pub const PF_ALTQF_TBR: u32 = 1;
pub const PF_ALTQ_QRF_WEIGHT: u32 = 1;
pub type __uint8_t = ::std::os::raw::c_uchar;
pub type __uint16_t = ::std::os::raw::c_ushort;
pub type __int32_t = ::std::os::raw::c_int;
pub type __uint32_t = ::std::os::raw::c_uint;
pub type __darwin_pid_t = __int32_t;
pub type __darwin_uid_t = __uint32_t;
pub type u_int8_t = ::std::os::raw::c_uchar;
pub type u_int16_t = ::std::os::raw::c_ushort;
pub type u_int32_t = ::std::os::raw::c_uint;
pub type u_int64_t = ::std::os::raw::c_ulonglong;
pub type caddr_t = *mut ::std::os::raw::c_char;
pub type in_addr_t = __uint32_t;
pub type pid_t = __darwin_pid_t;
pub type uid_t = __darwin_uid_t;
pub type sa_family_t = __uint8_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct in_addr {
    pub s_addr: in_addr_t,
}
#[test]
fn bindgen_test_layout_in_addr() {
    assert_eq!(
        ::std::mem::size_of::<in_addr>(),
        4usize,
        concat!("Size of: ", stringify!(in_addr))
    );
    assert_eq!(
        ::std::mem::align_of::<in_addr>(),
        4usize,
        concat!("Alignment of ", stringify!(in_addr))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<in_addr>())).s_addr as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(in_addr),
            "::",
            stringify!(s_addr)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct in6_addr {
    pub __u6_addr: in6_addr__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union in6_addr__bindgen_ty_1 {
    pub __u6_addr8: [__uint8_t; 16usize],
    pub __u6_addr16: [__uint16_t; 8usize],
    pub __u6_addr32: [__uint32_t; 4usize],
    _bindgen_union_align: [u32; 4usize],
}
#[test]
fn bindgen_test_layout_in6_addr__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<in6_addr__bindgen_ty_1>(),
        16usize,
        concat!("Size of: ", stringify!(in6_addr__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<in6_addr__bindgen_ty_1>(),
        4usize,
        concat!("Alignment of ", stringify!(in6_addr__bindgen_ty_1))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<in6_addr__bindgen_ty_1>())).__u6_addr8 as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(in6_addr__bindgen_ty_1),
            "::",
            stringify!(__u6_addr8)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<in6_addr__bindgen_ty_1>())).__u6_addr16 as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(in6_addr__bindgen_ty_1),
            "::",
            stringify!(__u6_addr16)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<in6_addr__bindgen_ty_1>())).__u6_addr32 as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(in6_addr__bindgen_ty_1),
            "::",
            stringify!(__u6_addr32)
        )
    );
}
#[test]
fn bindgen_test_layout_in6_addr() {
    assert_eq!(
        ::std::mem::size_of::<in6_addr>(),
        16usize,
        concat!("Size of: ", stringify!(in6_addr))
    );
    assert_eq!(
        ::std::mem::align_of::<in6_addr>(),
        4usize,
        concat!("Alignment of ", stringify!(in6_addr))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<in6_addr>())).__u6_addr as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(in6_addr),
            "::",
            stringify!(__u6_addr)
        )
    );
}
pub const PF_INOUT: _bindgen_ty_5 = 0;
pub const PF_IN: _bindgen_ty_5 = 1;
pub const PF_OUT: _bindgen_ty_5 = 2;
pub type _bindgen_ty_5 = u32;
pub const PF_PASS: _bindgen_ty_6 = 0;
pub const PF_DROP: _bindgen_ty_6 = 1;
pub const PF_SCRUB: _bindgen_ty_6 = 2;
pub const PF_NOSCRUB: _bindgen_ty_6 = 3;
pub const PF_NAT: _bindgen_ty_6 = 4;
pub const PF_NONAT: _bindgen_ty_6 = 5;
pub const PF_BINAT: _bindgen_ty_6 = 6;
pub const PF_NOBINAT: _bindgen_ty_6 = 7;
pub const PF_RDR: _bindgen_ty_6 = 8;
pub const PF_NORDR: _bindgen_ty_6 = 9;
pub const PF_SYNPROXY_DROP: _bindgen_ty_6 = 10;
pub const PF_DUMMYNET: _bindgen_ty_6 = 11;
pub const PF_NODUMMYNET: _bindgen_ty_6 = 12;
pub const PF_NAT64: _bindgen_ty_6 = 13;
pub const PF_NONAT64: _bindgen_ty_6 = 14;
pub type _bindgen_ty_6 = u32;
pub const PF_RULESET_SCRUB: _bindgen_ty_7 = 0;
pub const PF_RULESET_FILTER: _bindgen_ty_7 = 1;
pub const PF_RULESET_NAT: _bindgen_ty_7 = 2;
pub const PF_RULESET_BINAT: _bindgen_ty_7 = 3;
pub const PF_RULESET_RDR: _bindgen_ty_7 = 4;
pub const PF_RULESET_DUMMYNET: _bindgen_ty_7 = 5;
pub const PF_RULESET_MAX: _bindgen_ty_7 = 6;
pub type _bindgen_ty_7 = u32;
pub const PF_OP_NONE: _bindgen_ty_8 = 0;
pub const PF_OP_IRG: _bindgen_ty_8 = 1;
pub const PF_OP_EQ: _bindgen_ty_8 = 2;
pub const PF_OP_NE: _bindgen_ty_8 = 3;
pub const PF_OP_LT: _bindgen_ty_8 = 4;
pub const PF_OP_LE: _bindgen_ty_8 = 5;
pub const PF_OP_GT: _bindgen_ty_8 = 6;
pub const PF_OP_GE: _bindgen_ty_8 = 7;
pub const PF_OP_XRG: _bindgen_ty_8 = 8;
pub const PF_OP_RRG: _bindgen_ty_8 = 9;
pub type _bindgen_ty_8 = u32;
pub const PF_DEBUG_NONE: _bindgen_ty_9 = 0;
pub const PF_DEBUG_URGENT: _bindgen_ty_9 = 1;
pub const PF_DEBUG_MISC: _bindgen_ty_9 = 2;
pub const PF_DEBUG_NOISY: _bindgen_ty_9 = 3;
pub type _bindgen_ty_9 = u32;
pub const PF_CHANGE_NONE: _bindgen_ty_10 = 0;
pub const PF_CHANGE_ADD_HEAD: _bindgen_ty_10 = 1;
pub const PF_CHANGE_ADD_TAIL: _bindgen_ty_10 = 2;
pub const PF_CHANGE_ADD_BEFORE: _bindgen_ty_10 = 3;
pub const PF_CHANGE_ADD_AFTER: _bindgen_ty_10 = 4;
pub const PF_CHANGE_REMOVE: _bindgen_ty_10 = 5;
pub const PF_CHANGE_GET_TICKET: _bindgen_ty_10 = 6;
pub type _bindgen_ty_10 = u32;
pub const PF_GET_NONE: _bindgen_ty_11 = 0;
pub const PF_GET_CLR_CNTR: _bindgen_ty_11 = 1;
pub type _bindgen_ty_11 = u32;
pub const PF_NOPFROUTE: _bindgen_ty_13 = 0;
pub const PF_FASTROUTE: _bindgen_ty_13 = 1;
pub const PF_ROUTETO: _bindgen_ty_13 = 2;
pub const PF_DUPTO: _bindgen_ty_13 = 3;
pub const PF_REPLYTO: _bindgen_ty_13 = 4;
pub type _bindgen_ty_13 = u32;
pub const PF_LIMIT_STATES: _bindgen_ty_14 = 0;
pub const PF_LIMIT_APP_STATES: _bindgen_ty_14 = 1;
pub const PF_LIMIT_SRC_NODES: _bindgen_ty_14 = 2;
pub const PF_LIMIT_FRAGS: _bindgen_ty_14 = 3;
pub const PF_LIMIT_TABLES: _bindgen_ty_14 = 4;
pub const PF_LIMIT_TABLE_ENTRIES: _bindgen_ty_14 = 5;
pub const PF_LIMIT_MAX: _bindgen_ty_14 = 6;
pub type _bindgen_ty_14 = u32;
pub const PF_POOL_NONE: _bindgen_ty_15 = 0;
pub const PF_POOL_BITMASK: _bindgen_ty_15 = 1;
pub const PF_POOL_RANDOM: _bindgen_ty_15 = 2;
pub const PF_POOL_SRCHASH: _bindgen_ty_15 = 3;
pub const PF_POOL_ROUNDROBIN: _bindgen_ty_15 = 4;
pub type _bindgen_ty_15 = u32;
pub const PF_ADDR_ADDRMASK: _bindgen_ty_16 = 0;
pub const PF_ADDR_NOROUTE: _bindgen_ty_16 = 1;
pub const PF_ADDR_DYNIFTL: _bindgen_ty_16 = 2;
pub const PF_ADDR_TABLE: _bindgen_ty_16 = 3;
pub const PF_ADDR_RTLABEL: _bindgen_ty_16 = 4;
pub const PF_ADDR_URPFFAILED: _bindgen_ty_16 = 5;
pub const PF_ADDR_RANGE: _bindgen_ty_16 = 6;
pub type _bindgen_ty_16 = u32;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct pf_addr {
    pub pfa: pf_addr__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union pf_addr__bindgen_ty_1 {
    pub v4: in_addr,
    pub v6: in6_addr,
    pub addr8: [u_int8_t; 16usize],
    pub addr16: [u_int16_t; 8usize],
    pub addr32: [u_int32_t; 4usize],
    _bindgen_union_align: [u32; 4usize],
}
#[test]
fn bindgen_test_layout_pf_addr__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<pf_addr__bindgen_ty_1>(),
        16usize,
        concat!("Size of: ", stringify!(pf_addr__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<pf_addr__bindgen_ty_1>(),
        4usize,
        concat!("Alignment of ", stringify!(pf_addr__bindgen_ty_1))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pf_addr__bindgen_ty_1>())).v4 as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_addr__bindgen_ty_1),
            "::",
            stringify!(v4)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pf_addr__bindgen_ty_1>())).v6 as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_addr__bindgen_ty_1),
            "::",
            stringify!(v6)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pf_addr__bindgen_ty_1>())).addr8 as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_addr__bindgen_ty_1),
            "::",
            stringify!(addr8)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pf_addr__bindgen_ty_1>())).addr16 as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_addr__bindgen_ty_1),
            "::",
            stringify!(addr16)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pf_addr__bindgen_ty_1>())).addr32 as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_addr__bindgen_ty_1),
            "::",
            stringify!(addr32)
        )
    );
}
#[test]
fn bindgen_test_layout_pf_addr() {
    assert_eq!(
        ::std::mem::size_of::<pf_addr>(),
        16usize,
        concat!("Size of: ", stringify!(pf_addr))
    );
    assert_eq!(
        ::std::mem::align_of::<pf_addr>(),
        4usize,
        concat!("Alignment of ", stringify!(pf_addr))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pf_addr>())).pfa as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_addr),
            "::",
            stringify!(pfa)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct pf_addr_wrap {
    pub v: pf_addr_wrap__bindgen_ty_1,
    pub p: pf_addr_wrap__bindgen_ty_2,
    pub type_: u_int8_t,
    pub iflags: u_int8_t,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union pf_addr_wrap__bindgen_ty_1 {
    pub a: pf_addr_wrap__bindgen_ty_1__bindgen_ty_1,
    pub ifname: [::std::os::raw::c_char; 16usize],
    pub tblname: [::std::os::raw::c_char; 32usize],
    pub rtlabelname: [::std::os::raw::c_char; 32usize],
    pub rtlabel: u_int32_t,
    _bindgen_union_align: [u32; 8usize],
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct pf_addr_wrap__bindgen_ty_1__bindgen_ty_1 {
    pub addr: pf_addr,
    pub mask: pf_addr,
}
#[test]
fn bindgen_test_layout_pf_addr_wrap__bindgen_ty_1__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<pf_addr_wrap__bindgen_ty_1__bindgen_ty_1>(),
        32usize,
        concat!(
            "Size of: ",
            stringify!(pf_addr_wrap__bindgen_ty_1__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<pf_addr_wrap__bindgen_ty_1__bindgen_ty_1>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(pf_addr_wrap__bindgen_ty_1__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<pf_addr_wrap__bindgen_ty_1__bindgen_ty_1>())).addr as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_addr_wrap__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(addr)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<pf_addr_wrap__bindgen_ty_1__bindgen_ty_1>())).mask as *const _
                as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_addr_wrap__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(mask)
        )
    );
}
#[test]
fn bindgen_test_layout_pf_addr_wrap__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<pf_addr_wrap__bindgen_ty_1>(),
        32usize,
        concat!("Size of: ", stringify!(pf_addr_wrap__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<pf_addr_wrap__bindgen_ty_1>(),
        4usize,
        concat!("Alignment of ", stringify!(pf_addr_wrap__bindgen_ty_1))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pf_addr_wrap__bindgen_ty_1>())).a as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_addr_wrap__bindgen_ty_1),
            "::",
            stringify!(a)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<pf_addr_wrap__bindgen_ty_1>())).ifname as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_addr_wrap__bindgen_ty_1),
            "::",
            stringify!(ifname)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<pf_addr_wrap__bindgen_ty_1>())).tblname as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_addr_wrap__bindgen_ty_1),
            "::",
            stringify!(tblname)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<pf_addr_wrap__bindgen_ty_1>())).rtlabelname as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_addr_wrap__bindgen_ty_1),
            "::",
            stringify!(rtlabelname)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<pf_addr_wrap__bindgen_ty_1>())).rtlabel as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_addr_wrap__bindgen_ty_1),
            "::",
            stringify!(rtlabel)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union pf_addr_wrap__bindgen_ty_2 {
    pub r#dyn: *mut ::std::os::raw::c_void,
    pub tbl: *mut ::std::os::raw::c_void,
    pub dyncnt: ::std::os::raw::c_int,
    pub tblcnt: ::std::os::raw::c_int,
    _bindgen_union_align: u64,
}
#[test]
fn bindgen_test_layout_pf_addr_wrap__bindgen_ty_2() {
    assert_eq!(
        ::std::mem::size_of::<pf_addr_wrap__bindgen_ty_2>(),
        8usize,
        concat!("Size of: ", stringify!(pf_addr_wrap__bindgen_ty_2))
    );
    assert_eq!(
        ::std::mem::align_of::<pf_addr_wrap__bindgen_ty_2>(),
        8usize,
        concat!("Alignment of ", stringify!(pf_addr_wrap__bindgen_ty_2))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<pf_addr_wrap__bindgen_ty_2>())).r#dyn as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_addr_wrap__bindgen_ty_2),
            "::",
            stringify!(r#dyn)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pf_addr_wrap__bindgen_ty_2>())).tbl as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_addr_wrap__bindgen_ty_2),
            "::",
            stringify!(tbl)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<pf_addr_wrap__bindgen_ty_2>())).dyncnt as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_addr_wrap__bindgen_ty_2),
            "::",
            stringify!(dyncnt)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<pf_addr_wrap__bindgen_ty_2>())).tblcnt as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_addr_wrap__bindgen_ty_2),
            "::",
            stringify!(tblcnt)
        )
    );
}
#[test]
fn bindgen_test_layout_pf_addr_wrap() {
    assert_eq!(
        ::std::mem::size_of::<pf_addr_wrap>(),
        48usize,
        concat!("Size of: ", stringify!(pf_addr_wrap))
    );
    assert_eq!(
        ::std::mem::align_of::<pf_addr_wrap>(),
        8usize,
        concat!("Alignment of ", stringify!(pf_addr_wrap))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pf_addr_wrap>())).v as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_addr_wrap),
            "::",
            stringify!(v)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pf_addr_wrap>())).p as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_addr_wrap),
            "::",
            stringify!(p)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pf_addr_wrap>())).type_ as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_addr_wrap),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pf_addr_wrap>())).iflags as *const _ as usize },
        41usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_addr_wrap),
            "::",
            stringify!(iflags)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pf_port_range {
    pub port: [u_int16_t; 2usize],
    pub op: u_int8_t,
}
#[test]
fn bindgen_test_layout_pf_port_range() {
    assert_eq!(
        ::std::mem::size_of::<pf_port_range>(),
        6usize,
        concat!("Size of: ", stringify!(pf_port_range))
    );
    assert_eq!(
        ::std::mem::align_of::<pf_port_range>(),
        2usize,
        concat!("Alignment of ", stringify!(pf_port_range))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pf_port_range>())).port as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_port_range),
            "::",
            stringify!(port)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pf_port_range>())).op as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_port_range),
            "::",
            stringify!(op)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union pf_rule_xport {
    pub range: pf_port_range,
    pub call_id: u_int16_t,
    pub spi: u_int32_t,
    _bindgen_union_align: [u32; 2usize],
}
#[test]
fn bindgen_test_layout_pf_rule_xport() {
    assert_eq!(
        ::std::mem::size_of::<pf_rule_xport>(),
        8usize,
        concat!("Size of: ", stringify!(pf_rule_xport))
    );
    assert_eq!(
        ::std::mem::align_of::<pf_rule_xport>(),
        4usize,
        concat!("Alignment of ", stringify!(pf_rule_xport))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pf_rule_xport>())).range as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_rule_xport),
            "::",
            stringify!(range)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pf_rule_xport>())).call_id as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_rule_xport),
            "::",
            stringify!(call_id)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pf_rule_xport>())).spi as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_rule_xport),
            "::",
            stringify!(spi)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pf_rule_uid {
    pub uid: [uid_t; 2usize],
    pub op: u_int8_t,
    pub _pad: [u_int8_t; 3usize],
}
#[test]
fn bindgen_test_layout_pf_rule_uid() {
    assert_eq!(
        ::std::mem::size_of::<pf_rule_uid>(),
        12usize,
        concat!("Size of: ", stringify!(pf_rule_uid))
    );
    assert_eq!(
        ::std::mem::align_of::<pf_rule_uid>(),
        4usize,
        concat!("Alignment of ", stringify!(pf_rule_uid))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pf_rule_uid>())).uid as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_rule_uid),
            "::",
            stringify!(uid)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pf_rule_uid>())).op as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_rule_uid),
            "::",
            stringify!(op)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pf_rule_uid>()))._pad as *const _ as usize },
        9usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_rule_uid),
            "::",
            stringify!(_pad)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pf_rule_gid {
    pub gid: [uid_t; 2usize],
    pub op: u_int8_t,
    pub _pad: [u_int8_t; 3usize],
}
#[test]
fn bindgen_test_layout_pf_rule_gid() {
    assert_eq!(
        ::std::mem::size_of::<pf_rule_gid>(),
        12usize,
        concat!("Size of: ", stringify!(pf_rule_gid))
    );
    assert_eq!(
        ::std::mem::align_of::<pf_rule_gid>(),
        4usize,
        concat!("Alignment of ", stringify!(pf_rule_gid))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pf_rule_gid>())).gid as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_rule_gid),
            "::",
            stringify!(gid)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pf_rule_gid>())).op as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_rule_gid),
            "::",
            stringify!(op)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pf_rule_gid>()))._pad as *const _ as usize },
        9usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_rule_gid),
            "::",
            stringify!(_pad)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct pf_rule_addr {
    pub addr: pf_addr_wrap,
    pub xport: pf_rule_xport,
    pub neg: u_int8_t,
}
#[test]
fn bindgen_test_layout_pf_rule_addr() {
    assert_eq!(
        ::std::mem::size_of::<pf_rule_addr>(),
        64usize,
        concat!("Size of: ", stringify!(pf_rule_addr))
    );
    assert_eq!(
        ::std::mem::align_of::<pf_rule_addr>(),
        8usize,
        concat!("Alignment of ", stringify!(pf_rule_addr))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pf_rule_addr>())).addr as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_rule_addr),
            "::",
            stringify!(addr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pf_rule_addr>())).xport as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_rule_addr),
            "::",
            stringify!(xport)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pf_rule_addr>())).neg as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_rule_addr),
            "::",
            stringify!(neg)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct pf_pooladdr {
    pub addr: pf_addr_wrap,
    pub entries: pf_pooladdr__bindgen_ty_1,
    pub ifname: [::std::os::raw::c_char; 16usize],
    pub kif: *mut ::std::os::raw::c_void,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pf_pooladdr__bindgen_ty_1 {
    pub tqe_next: *mut pf_pooladdr,
    pub tqe_prev: *mut *mut pf_pooladdr,
}
#[test]
fn bindgen_test_layout_pf_pooladdr__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<pf_pooladdr__bindgen_ty_1>(),
        16usize,
        concat!("Size of: ", stringify!(pf_pooladdr__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<pf_pooladdr__bindgen_ty_1>(),
        8usize,
        concat!("Alignment of ", stringify!(pf_pooladdr__bindgen_ty_1))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<pf_pooladdr__bindgen_ty_1>())).tqe_next as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_pooladdr__bindgen_ty_1),
            "::",
            stringify!(tqe_next)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<pf_pooladdr__bindgen_ty_1>())).tqe_prev as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_pooladdr__bindgen_ty_1),
            "::",
            stringify!(tqe_prev)
        )
    );
}
#[test]
fn bindgen_test_layout_pf_pooladdr() {
    assert_eq!(
        ::std::mem::size_of::<pf_pooladdr>(),
        88usize,
        concat!("Size of: ", stringify!(pf_pooladdr))
    );
    assert_eq!(
        ::std::mem::align_of::<pf_pooladdr>(),
        8usize,
        concat!("Alignment of ", stringify!(pf_pooladdr))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pf_pooladdr>())).addr as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_pooladdr),
            "::",
            stringify!(addr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pf_pooladdr>())).entries as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_pooladdr),
            "::",
            stringify!(entries)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pf_pooladdr>())).ifname as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_pooladdr),
            "::",
            stringify!(ifname)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pf_pooladdr>())).kif as *const _ as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_pooladdr),
            "::",
            stringify!(kif)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pf_palist {
    pub tqh_first: *mut pf_pooladdr,
    pub tqh_last: *mut *mut pf_pooladdr,
}
#[test]
fn bindgen_test_layout_pf_palist() {
    assert_eq!(
        ::std::mem::size_of::<pf_palist>(),
        16usize,
        concat!("Size of: ", stringify!(pf_palist))
    );
    assert_eq!(
        ::std::mem::align_of::<pf_palist>(),
        8usize,
        concat!("Alignment of ", stringify!(pf_palist))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pf_palist>())).tqh_first as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_palist),
            "::",
            stringify!(tqh_first)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pf_palist>())).tqh_last as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_palist),
            "::",
            stringify!(tqh_last)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct pf_poolhashkey {
    pub pfk: pf_poolhashkey__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union pf_poolhashkey__bindgen_ty_1 {
    pub key8: [u_int8_t; 16usize],
    pub key16: [u_int16_t; 8usize],
    pub key32: [u_int32_t; 4usize],
    _bindgen_union_align: [u32; 4usize],
}
#[test]
fn bindgen_test_layout_pf_poolhashkey__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<pf_poolhashkey__bindgen_ty_1>(),
        16usize,
        concat!("Size of: ", stringify!(pf_poolhashkey__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<pf_poolhashkey__bindgen_ty_1>(),
        4usize,
        concat!("Alignment of ", stringify!(pf_poolhashkey__bindgen_ty_1))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<pf_poolhashkey__bindgen_ty_1>())).key8 as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_poolhashkey__bindgen_ty_1),
            "::",
            stringify!(key8)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<pf_poolhashkey__bindgen_ty_1>())).key16 as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_poolhashkey__bindgen_ty_1),
            "::",
            stringify!(key16)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<pf_poolhashkey__bindgen_ty_1>())).key32 as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_poolhashkey__bindgen_ty_1),
            "::",
            stringify!(key32)
        )
    );
}
#[test]
fn bindgen_test_layout_pf_poolhashkey() {
    assert_eq!(
        ::std::mem::size_of::<pf_poolhashkey>(),
        16usize,
        concat!("Size of: ", stringify!(pf_poolhashkey))
    );
    assert_eq!(
        ::std::mem::align_of::<pf_poolhashkey>(),
        4usize,
        concat!("Alignment of ", stringify!(pf_poolhashkey))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pf_poolhashkey>())).pfk as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_poolhashkey),
            "::",
            stringify!(pfk)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct pf_pool {
    pub list: pf_palist,
    pub cur: *mut ::std::os::raw::c_void,
    pub key: pf_poolhashkey,
    pub counter: pf_addr,
    pub tblidx: ::std::os::raw::c_int,
    pub proxy_port: [u_int16_t; 2usize],
    pub port_op: u_int8_t,
    pub opts: u_int8_t,
    pub af: sa_family_t,
}
#[test]
fn bindgen_test_layout_pf_pool() {
    assert_eq!(
        ::std::mem::size_of::<pf_pool>(),
        72usize,
        concat!("Size of: ", stringify!(pf_pool))
    );
    assert_eq!(
        ::std::mem::align_of::<pf_pool>(),
        8usize,
        concat!("Alignment of ", stringify!(pf_pool))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pf_pool>())).list as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_pool),
            "::",
            stringify!(list)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pf_pool>())).cur as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_pool),
            "::",
            stringify!(cur)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pf_pool>())).key as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_pool),
            "::",
            stringify!(key)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pf_pool>())).counter as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_pool),
            "::",
            stringify!(counter)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pf_pool>())).tblidx as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_pool),
            "::",
            stringify!(tblidx)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pf_pool>())).proxy_port as *const _ as usize },
        60usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_pool),
            "::",
            stringify!(proxy_port)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pf_pool>())).port_op as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_pool),
            "::",
            stringify!(port_op)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pf_pool>())).opts as *const _ as usize },
        65usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_pool),
            "::",
            stringify!(opts)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pf_pool>())).af as *const _ as usize },
        66usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_pool),
            "::",
            stringify!(af)
        )
    );
}
pub type pf_osfp_t = u_int32_t;
#[repr(C)]
#[derive(Copy, Clone)]
pub union pf_rule_ptr {
    pub ptr: *mut pf_rule,
    pub nr: u_int32_t,
    _bindgen_union_align: u64,
}
#[test]
fn bindgen_test_layout_pf_rule_ptr() {
    assert_eq!(
        ::std::mem::size_of::<pf_rule_ptr>(),
        8usize,
        concat!("Size of: ", stringify!(pf_rule_ptr))
    );
    assert_eq!(
        ::std::mem::align_of::<pf_rule_ptr>(),
        8usize,
        concat!("Alignment of ", stringify!(pf_rule_ptr))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pf_rule_ptr>())).ptr as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_rule_ptr),
            "::",
            stringify!(ptr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pf_rule_ptr>())).nr as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_rule_ptr),
            "::",
            stringify!(nr)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct pf_rule {
    pub src: pf_rule_addr,
    pub dst: pf_rule_addr,
    pub skip: [pf_rule_ptr; 8usize],
    pub label: [::std::os::raw::c_char; 64usize],
    pub ifname: [::std::os::raw::c_char; 16usize],
    pub qname: [::std::os::raw::c_char; 64usize],
    pub pqname: [::std::os::raw::c_char; 64usize],
    pub tagname: [::std::os::raw::c_char; 64usize],
    pub match_tagname: [::std::os::raw::c_char; 64usize],
    pub overload_tblname: [::std::os::raw::c_char; 32usize],
    pub entries: pf_rule__bindgen_ty_1,
    pub rpool: pf_pool,
    pub evaluations: u_int64_t,
    pub packets: [u_int64_t; 2usize],
    pub bytes: [u_int64_t; 2usize],
    pub ticket: u_int64_t,
    pub owner: [::std::os::raw::c_char; 64usize],
    pub priority: u_int32_t,
    pub kif: *mut ::std::os::raw::c_void,
    pub anchor: *mut pf_anchor,
    pub overload_tbl: *mut ::std::os::raw::c_void,
    pub os_fingerprint: pf_osfp_t,
    pub rtableid: ::std::os::raw::c_uint,
    pub timeout: [u_int32_t; 26usize],
    pub states: u_int32_t,
    pub max_states: u_int32_t,
    pub src_nodes: u_int32_t,
    pub max_src_nodes: u_int32_t,
    pub max_src_states: u_int32_t,
    pub max_src_conn: u_int32_t,
    pub max_src_conn_rate: pf_rule__bindgen_ty_2,
    pub qid: u_int32_t,
    pub pqid: u_int32_t,
    pub rt_listid: u_int32_t,
    pub nr: u_int32_t,
    pub prob: u_int32_t,
    pub cuid: uid_t,
    pub cpid: pid_t,
    pub return_icmp: u_int16_t,
    pub return_icmp6: u_int16_t,
    pub max_mss: u_int16_t,
    pub tag: u_int16_t,
    pub match_tag: u_int16_t,
    pub uid: pf_rule_uid,
    pub gid: pf_rule_gid,
    pub rule_flag: u_int32_t,
    pub action: u_int8_t,
    pub direction: u_int8_t,
    pub log: u_int8_t,
    pub logif: u_int8_t,
    pub quick: u_int8_t,
    pub ifnot: u_int8_t,
    pub match_tag_not: u_int8_t,
    pub natpass: u_int8_t,
    pub keep_state: u_int8_t,
    pub af: sa_family_t,
    pub proto: u_int8_t,
    pub type_: u_int8_t,
    pub code: u_int8_t,
    pub flags: u_int8_t,
    pub flagset: u_int8_t,
    pub min_ttl: u_int8_t,
    pub allow_opts: u_int8_t,
    pub rt: u_int8_t,
    pub return_ttl: u_int8_t,
    pub tos: u_int8_t,
    pub anchor_relative: u_int8_t,
    pub anchor_wildcard: u_int8_t,
    pub flush: u_int8_t,
    pub proto_variant: u_int8_t,
    pub extfilter: u_int8_t,
    pub extmap: u_int8_t,
    pub dnpipe: u_int32_t,
    pub dntype: u_int32_t,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pf_rule__bindgen_ty_1 {
    pub tqe_next: *mut pf_rule,
    pub tqe_prev: *mut *mut pf_rule,
}
#[test]
fn bindgen_test_layout_pf_rule__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<pf_rule__bindgen_ty_1>(),
        16usize,
        concat!("Size of: ", stringify!(pf_rule__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<pf_rule__bindgen_ty_1>(),
        8usize,
        concat!("Alignment of ", stringify!(pf_rule__bindgen_ty_1))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pf_rule__bindgen_ty_1>())).tqe_next as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_rule__bindgen_ty_1),
            "::",
            stringify!(tqe_next)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pf_rule__bindgen_ty_1>())).tqe_prev as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_rule__bindgen_ty_1),
            "::",
            stringify!(tqe_prev)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pf_rule__bindgen_ty_2 {
    pub limit: u_int32_t,
    pub seconds: u_int32_t,
}
#[test]
fn bindgen_test_layout_pf_rule__bindgen_ty_2() {
    assert_eq!(
        ::std::mem::size_of::<pf_rule__bindgen_ty_2>(),
        8usize,
        concat!("Size of: ", stringify!(pf_rule__bindgen_ty_2))
    );
    assert_eq!(
        ::std::mem::align_of::<pf_rule__bindgen_ty_2>(),
        4usize,
        concat!("Alignment of ", stringify!(pf_rule__bindgen_ty_2))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pf_rule__bindgen_ty_2>())).limit as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_rule__bindgen_ty_2),
            "::",
            stringify!(limit)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pf_rule__bindgen_ty_2>())).seconds as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_rule__bindgen_ty_2),
            "::",
            stringify!(seconds)
        )
    );
}
#[test]
fn bindgen_test_layout_pf_rule() {
    assert_eq!(
        ::std::mem::size_of::<pf_rule>(),
        1040usize,
        concat!("Size of: ", stringify!(pf_rule))
    );
    assert_eq!(
        ::std::mem::align_of::<pf_rule>(),
        8usize,
        concat!("Alignment of ", stringify!(pf_rule))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pf_rule>())).src as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_rule),
            "::",
            stringify!(src)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pf_rule>())).dst as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_rule),
            "::",
            stringify!(dst)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pf_rule>())).skip as *const _ as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_rule),
            "::",
            stringify!(skip)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pf_rule>())).label as *const _ as usize },
        192usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_rule),
            "::",
            stringify!(label)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pf_rule>())).ifname as *const _ as usize },
        256usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_rule),
            "::",
            stringify!(ifname)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pf_rule>())).qname as *const _ as usize },
        272usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_rule),
            "::",
            stringify!(qname)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pf_rule>())).pqname as *const _ as usize },
        336usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_rule),
            "::",
            stringify!(pqname)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pf_rule>())).tagname as *const _ as usize },
        400usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_rule),
            "::",
            stringify!(tagname)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pf_rule>())).match_tagname as *const _ as usize },
        464usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_rule),
            "::",
            stringify!(match_tagname)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pf_rule>())).overload_tblname as *const _ as usize },
        528usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_rule),
            "::",
            stringify!(overload_tblname)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pf_rule>())).entries as *const _ as usize },
        560usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_rule),
            "::",
            stringify!(entries)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pf_rule>())).rpool as *const _ as usize },
        576usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_rule),
            "::",
            stringify!(rpool)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pf_rule>())).evaluations as *const _ as usize },
        648usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_rule),
            "::",
            stringify!(evaluations)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pf_rule>())).packets as *const _ as usize },
        656usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_rule),
            "::",
            stringify!(packets)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pf_rule>())).bytes as *const _ as usize },
        672usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_rule),
            "::",
            stringify!(bytes)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pf_rule>())).ticket as *const _ as usize },
        688usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_rule),
            "::",
            stringify!(ticket)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pf_rule>())).owner as *const _ as usize },
        696usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_rule),
            "::",
            stringify!(owner)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pf_rule>())).priority as *const _ as usize },
        760usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_rule),
            "::",
            stringify!(priority)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pf_rule>())).kif as *const _ as usize },
        768usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_rule),
            "::",
            stringify!(kif)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pf_rule>())).anchor as *const _ as usize },
        776usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_rule),
            "::",
            stringify!(anchor)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pf_rule>())).overload_tbl as *const _ as usize },
        784usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_rule),
            "::",
            stringify!(overload_tbl)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pf_rule>())).os_fingerprint as *const _ as usize },
        792usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_rule),
            "::",
            stringify!(os_fingerprint)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pf_rule>())).rtableid as *const _ as usize },
        796usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_rule),
            "::",
            stringify!(rtableid)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pf_rule>())).timeout as *const _ as usize },
        800usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_rule),
            "::",
            stringify!(timeout)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pf_rule>())).states as *const _ as usize },
        904usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_rule),
            "::",
            stringify!(states)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pf_rule>())).max_states as *const _ as usize },
        908usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_rule),
            "::",
            stringify!(max_states)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pf_rule>())).src_nodes as *const _ as usize },
        912usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_rule),
            "::",
            stringify!(src_nodes)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pf_rule>())).max_src_nodes as *const _ as usize },
        916usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_rule),
            "::",
            stringify!(max_src_nodes)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pf_rule>())).max_src_states as *const _ as usize },
        920usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_rule),
            "::",
            stringify!(max_src_states)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pf_rule>())).max_src_conn as *const _ as usize },
        924usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_rule),
            "::",
            stringify!(max_src_conn)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pf_rule>())).max_src_conn_rate as *const _ as usize },
        928usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_rule),
            "::",
            stringify!(max_src_conn_rate)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pf_rule>())).qid as *const _ as usize },
        936usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_rule),
            "::",
            stringify!(qid)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pf_rule>())).pqid as *const _ as usize },
        940usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_rule),
            "::",
            stringify!(pqid)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pf_rule>())).rt_listid as *const _ as usize },
        944usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_rule),
            "::",
            stringify!(rt_listid)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pf_rule>())).nr as *const _ as usize },
        948usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_rule),
            "::",
            stringify!(nr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pf_rule>())).prob as *const _ as usize },
        952usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_rule),
            "::",
            stringify!(prob)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pf_rule>())).cuid as *const _ as usize },
        956usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_rule),
            "::",
            stringify!(cuid)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pf_rule>())).cpid as *const _ as usize },
        960usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_rule),
            "::",
            stringify!(cpid)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pf_rule>())).return_icmp as *const _ as usize },
        964usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_rule),
            "::",
            stringify!(return_icmp)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pf_rule>())).return_icmp6 as *const _ as usize },
        966usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_rule),
            "::",
            stringify!(return_icmp6)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pf_rule>())).max_mss as *const _ as usize },
        968usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_rule),
            "::",
            stringify!(max_mss)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pf_rule>())).tag as *const _ as usize },
        970usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_rule),
            "::",
            stringify!(tag)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pf_rule>())).match_tag as *const _ as usize },
        972usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_rule),
            "::",
            stringify!(match_tag)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pf_rule>())).uid as *const _ as usize },
        976usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_rule),
            "::",
            stringify!(uid)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pf_rule>())).gid as *const _ as usize },
        988usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_rule),
            "::",
            stringify!(gid)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pf_rule>())).rule_flag as *const _ as usize },
        1000usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_rule),
            "::",
            stringify!(rule_flag)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pf_rule>())).action as *const _ as usize },
        1004usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_rule),
            "::",
            stringify!(action)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pf_rule>())).direction as *const _ as usize },
        1005usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_rule),
            "::",
            stringify!(direction)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pf_rule>())).log as *const _ as usize },
        1006usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_rule),
            "::",
            stringify!(log)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pf_rule>())).logif as *const _ as usize },
        1007usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_rule),
            "::",
            stringify!(logif)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pf_rule>())).quick as *const _ as usize },
        1008usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_rule),
            "::",
            stringify!(quick)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pf_rule>())).ifnot as *const _ as usize },
        1009usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_rule),
            "::",
            stringify!(ifnot)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pf_rule>())).match_tag_not as *const _ as usize },
        1010usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_rule),
            "::",
            stringify!(match_tag_not)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pf_rule>())).natpass as *const _ as usize },
        1011usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_rule),
            "::",
            stringify!(natpass)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pf_rule>())).keep_state as *const _ as usize },
        1012usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_rule),
            "::",
            stringify!(keep_state)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pf_rule>())).af as *const _ as usize },
        1013usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_rule),
            "::",
            stringify!(af)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pf_rule>())).proto as *const _ as usize },
        1014usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_rule),
            "::",
            stringify!(proto)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pf_rule>())).type_ as *const _ as usize },
        1015usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_rule),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pf_rule>())).code as *const _ as usize },
        1016usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_rule),
            "::",
            stringify!(code)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pf_rule>())).flags as *const _ as usize },
        1017usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_rule),
            "::",
            stringify!(flags)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pf_rule>())).flagset as *const _ as usize },
        1018usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_rule),
            "::",
            stringify!(flagset)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pf_rule>())).min_ttl as *const _ as usize },
        1019usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_rule),
            "::",
            stringify!(min_ttl)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pf_rule>())).allow_opts as *const _ as usize },
        1020usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_rule),
            "::",
            stringify!(allow_opts)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pf_rule>())).rt as *const _ as usize },
        1021usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_rule),
            "::",
            stringify!(rt)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pf_rule>())).return_ttl as *const _ as usize },
        1022usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_rule),
            "::",
            stringify!(return_ttl)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pf_rule>())).tos as *const _ as usize },
        1023usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_rule),
            "::",
            stringify!(tos)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pf_rule>())).anchor_relative as *const _ as usize },
        1024usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_rule),
            "::",
            stringify!(anchor_relative)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pf_rule>())).anchor_wildcard as *const _ as usize },
        1025usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_rule),
            "::",
            stringify!(anchor_wildcard)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pf_rule>())).flush as *const _ as usize },
        1026usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_rule),
            "::",
            stringify!(flush)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pf_rule>())).proto_variant as *const _ as usize },
        1027usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_rule),
            "::",
            stringify!(proto_variant)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pf_rule>())).extfilter as *const _ as usize },
        1028usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_rule),
            "::",
            stringify!(extfilter)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pf_rule>())).extmap as *const _ as usize },
        1029usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_rule),
            "::",
            stringify!(extmap)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pf_rule>())).dnpipe as *const _ as usize },
        1032usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_rule),
            "::",
            stringify!(dnpipe)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pf_rule>())).dntype as *const _ as usize },
        1036usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_rule),
            "::",
            stringify!(dntype)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union pf_state_xport {
    pub port: u_int16_t,
    pub call_id: u_int16_t,
    pub spi: u_int32_t,
    _bindgen_union_align: u32,
}
#[test]
fn bindgen_test_layout_pf_state_xport() {
    assert_eq!(
        ::std::mem::size_of::<pf_state_xport>(),
        4usize,
        concat!("Size of: ", stringify!(pf_state_xport))
    );
    assert_eq!(
        ::std::mem::align_of::<pf_state_xport>(),
        4usize,
        concat!("Alignment of ", stringify!(pf_state_xport))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pf_state_xport>())).port as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_state_xport),
            "::",
            stringify!(port)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pf_state_xport>())).call_id as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_state_xport),
            "::",
            stringify!(call_id)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pf_state_xport>())).spi as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_state_xport),
            "::",
            stringify!(spi)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct hook_desc {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct hook_desc_head {
    pub tqh_first: *mut hook_desc,
    pub tqh_last: *mut *mut hook_desc,
}
#[test]
fn bindgen_test_layout_hook_desc_head() {
    assert_eq!(
        ::std::mem::size_of::<hook_desc_head>(),
        16usize,
        concat!("Size of: ", stringify!(hook_desc_head))
    );
    assert_eq!(
        ::std::mem::align_of::<hook_desc_head>(),
        8usize,
        concat!("Alignment of ", stringify!(hook_desc_head))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<hook_desc_head>())).tqh_first as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(hook_desc_head),
            "::",
            stringify!(tqh_first)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<hook_desc_head>())).tqh_last as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(hook_desc_head),
            "::",
            stringify!(tqh_last)
        )
    );
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct pfsync_state_scrub {
    pub pfss_flags: u_int16_t,
    pub pfss_ttl: u_int8_t,
    pub scrub_flag: u_int8_t,
    pub pfss_ts_mod: u_int32_t,
}
#[test]
fn bindgen_test_layout_pfsync_state_scrub() {
    assert_eq!(
        ::std::mem::size_of::<pfsync_state_scrub>(),
        8usize,
        concat!("Size of: ", stringify!(pfsync_state_scrub))
    );
    assert_eq!(
        ::std::mem::align_of::<pfsync_state_scrub>(),
        1usize,
        concat!("Alignment of ", stringify!(pfsync_state_scrub))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pfsync_state_scrub>())).pfss_flags as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pfsync_state_scrub),
            "::",
            stringify!(pfss_flags)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pfsync_state_scrub>())).pfss_ttl as *const _ as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(pfsync_state_scrub),
            "::",
            stringify!(pfss_ttl)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pfsync_state_scrub>())).scrub_flag as *const _ as usize },
        3usize,
        concat!(
            "Offset of field: ",
            stringify!(pfsync_state_scrub),
            "::",
            stringify!(scrub_flag)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pfsync_state_scrub>())).pfss_ts_mod as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(pfsync_state_scrub),
            "::",
            stringify!(pfss_ts_mod)
        )
    );
}
#[repr(C, packed)]
#[derive(Copy, Clone)]
pub struct pfsync_state_host {
    pub addr: pf_addr,
    pub xport: pf_state_xport,
    pub pad: [u_int16_t; 2usize],
}
#[test]
fn bindgen_test_layout_pfsync_state_host() {
    assert_eq!(
        ::std::mem::size_of::<pfsync_state_host>(),
        24usize,
        concat!("Size of: ", stringify!(pfsync_state_host))
    );
    assert_eq!(
        ::std::mem::align_of::<pfsync_state_host>(),
        1usize,
        concat!("Alignment of ", stringify!(pfsync_state_host))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pfsync_state_host>())).addr as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pfsync_state_host),
            "::",
            stringify!(addr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pfsync_state_host>())).xport as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(pfsync_state_host),
            "::",
            stringify!(xport)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pfsync_state_host>())).pad as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(pfsync_state_host),
            "::",
            stringify!(pad)
        )
    );
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct pfsync_state_peer {
    pub scrub: pfsync_state_scrub,
    pub seqlo: u_int32_t,
    pub seqhi: u_int32_t,
    pub seqdiff: u_int32_t,
    pub max_win: u_int16_t,
    pub mss: u_int16_t,
    pub state: u_int8_t,
    pub wscale: u_int8_t,
    pub pad: [u_int8_t; 6usize],
}
#[test]
fn bindgen_test_layout_pfsync_state_peer() {
    assert_eq!(
        ::std::mem::size_of::<pfsync_state_peer>(),
        32usize,
        concat!("Size of: ", stringify!(pfsync_state_peer))
    );
    assert_eq!(
        ::std::mem::align_of::<pfsync_state_peer>(),
        1usize,
        concat!("Alignment of ", stringify!(pfsync_state_peer))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pfsync_state_peer>())).scrub as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pfsync_state_peer),
            "::",
            stringify!(scrub)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pfsync_state_peer>())).seqlo as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(pfsync_state_peer),
            "::",
            stringify!(seqlo)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pfsync_state_peer>())).seqhi as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(pfsync_state_peer),
            "::",
            stringify!(seqhi)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pfsync_state_peer>())).seqdiff as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(pfsync_state_peer),
            "::",
            stringify!(seqdiff)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pfsync_state_peer>())).max_win as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(pfsync_state_peer),
            "::",
            stringify!(max_win)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pfsync_state_peer>())).mss as *const _ as usize },
        22usize,
        concat!(
            "Offset of field: ",
            stringify!(pfsync_state_peer),
            "::",
            stringify!(mss)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pfsync_state_peer>())).state as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(pfsync_state_peer),
            "::",
            stringify!(state)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pfsync_state_peer>())).wscale as *const _ as usize },
        25usize,
        concat!(
            "Offset of field: ",
            stringify!(pfsync_state_peer),
            "::",
            stringify!(wscale)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pfsync_state_peer>())).pad as *const _ as usize },
        26usize,
        concat!(
            "Offset of field: ",
            stringify!(pfsync_state_peer),
            "::",
            stringify!(pad)
        )
    );
}
#[repr(C, packed)]
#[derive(Copy, Clone)]
pub struct pfsync_state {
    pub id: [u_int32_t; 2usize],
    pub ifname: [::std::os::raw::c_char; 16usize],
    pub lan: pfsync_state_host,
    pub gwy: pfsync_state_host,
    pub ext_lan: pfsync_state_host,
    pub ext_gwy: pfsync_state_host,
    pub src: pfsync_state_peer,
    pub dst: pfsync_state_peer,
    pub rt_addr: pf_addr,
    pub unlink_hooks: hook_desc_head,
    pub rule: u_int32_t,
    pub anchor: u_int32_t,
    pub nat_rule: u_int32_t,
    pub creation: u_int64_t,
    pub expire: u_int64_t,
    pub packets: [[u_int32_t; 2usize]; 2usize],
    pub bytes: [[u_int32_t; 2usize]; 2usize],
    pub creatorid: u_int32_t,
    pub tag: u_int16_t,
    pub af_lan: sa_family_t,
    pub af_gwy: sa_family_t,
    pub proto: u_int8_t,
    pub direction: u_int8_t,
    pub log: u_int8_t,
    pub allow_opts: u_int8_t,
    pub timeout: u_int8_t,
    pub sync_flags: u_int8_t,
    pub updates: u_int8_t,
    pub proto_variant: u_int8_t,
    pub __pad: u_int8_t,
    pub flowhash: u_int32_t,
}
#[test]
fn bindgen_test_layout_pfsync_state() {
    assert_eq!(
        ::std::mem::size_of::<pfsync_state>(),
        297usize,
        concat!("Size of: ", stringify!(pfsync_state))
    );
    assert_eq!(
        ::std::mem::align_of::<pfsync_state>(),
        1usize,
        concat!("Alignment of ", stringify!(pfsync_state))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pfsync_state>())).id as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pfsync_state),
            "::",
            stringify!(id)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pfsync_state>())).ifname as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(pfsync_state),
            "::",
            stringify!(ifname)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pfsync_state>())).lan as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(pfsync_state),
            "::",
            stringify!(lan)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pfsync_state>())).gwy as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(pfsync_state),
            "::",
            stringify!(gwy)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pfsync_state>())).ext_lan as *const _ as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(pfsync_state),
            "::",
            stringify!(ext_lan)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pfsync_state>())).ext_gwy as *const _ as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(pfsync_state),
            "::",
            stringify!(ext_gwy)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pfsync_state>())).src as *const _ as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(pfsync_state),
            "::",
            stringify!(src)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pfsync_state>())).dst as *const _ as usize },
        152usize,
        concat!(
            "Offset of field: ",
            stringify!(pfsync_state),
            "::",
            stringify!(dst)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pfsync_state>())).rt_addr as *const _ as usize },
        184usize,
        concat!(
            "Offset of field: ",
            stringify!(pfsync_state),
            "::",
            stringify!(rt_addr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pfsync_state>())).unlink_hooks as *const _ as usize },
        200usize,
        concat!(
            "Offset of field: ",
            stringify!(pfsync_state),
            "::",
            stringify!(unlink_hooks)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pfsync_state>())).rule as *const _ as usize },
        216usize,
        concat!(
            "Offset of field: ",
            stringify!(pfsync_state),
            "::",
            stringify!(rule)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pfsync_state>())).anchor as *const _ as usize },
        220usize,
        concat!(
            "Offset of field: ",
            stringify!(pfsync_state),
            "::",
            stringify!(anchor)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pfsync_state>())).nat_rule as *const _ as usize },
        224usize,
        concat!(
            "Offset of field: ",
            stringify!(pfsync_state),
            "::",
            stringify!(nat_rule)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pfsync_state>())).creation as *const _ as usize },
        228usize,
        concat!(
            "Offset of field: ",
            stringify!(pfsync_state),
            "::",
            stringify!(creation)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pfsync_state>())).expire as *const _ as usize },
        236usize,
        concat!(
            "Offset of field: ",
            stringify!(pfsync_state),
            "::",
            stringify!(expire)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pfsync_state>())).packets as *const _ as usize },
        244usize,
        concat!(
            "Offset of field: ",
            stringify!(pfsync_state),
            "::",
            stringify!(packets)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pfsync_state>())).bytes as *const _ as usize },
        260usize,
        concat!(
            "Offset of field: ",
            stringify!(pfsync_state),
            "::",
            stringify!(bytes)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pfsync_state>())).creatorid as *const _ as usize },
        276usize,
        concat!(
            "Offset of field: ",
            stringify!(pfsync_state),
            "::",
            stringify!(creatorid)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pfsync_state>())).tag as *const _ as usize },
        280usize,
        concat!(
            "Offset of field: ",
            stringify!(pfsync_state),
            "::",
            stringify!(tag)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pfsync_state>())).af_lan as *const _ as usize },
        282usize,
        concat!(
            "Offset of field: ",
            stringify!(pfsync_state),
            "::",
            stringify!(af_lan)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pfsync_state>())).af_gwy as *const _ as usize },
        283usize,
        concat!(
            "Offset of field: ",
            stringify!(pfsync_state),
            "::",
            stringify!(af_gwy)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pfsync_state>())).proto as *const _ as usize },
        284usize,
        concat!(
            "Offset of field: ",
            stringify!(pfsync_state),
            "::",
            stringify!(proto)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pfsync_state>())).direction as *const _ as usize },
        285usize,
        concat!(
            "Offset of field: ",
            stringify!(pfsync_state),
            "::",
            stringify!(direction)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pfsync_state>())).log as *const _ as usize },
        286usize,
        concat!(
            "Offset of field: ",
            stringify!(pfsync_state),
            "::",
            stringify!(log)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pfsync_state>())).allow_opts as *const _ as usize },
        287usize,
        concat!(
            "Offset of field: ",
            stringify!(pfsync_state),
            "::",
            stringify!(allow_opts)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pfsync_state>())).timeout as *const _ as usize },
        288usize,
        concat!(
            "Offset of field: ",
            stringify!(pfsync_state),
            "::",
            stringify!(timeout)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pfsync_state>())).sync_flags as *const _ as usize },
        289usize,
        concat!(
            "Offset of field: ",
            stringify!(pfsync_state),
            "::",
            stringify!(sync_flags)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pfsync_state>())).updates as *const _ as usize },
        290usize,
        concat!(
            "Offset of field: ",
            stringify!(pfsync_state),
            "::",
            stringify!(updates)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pfsync_state>())).proto_variant as *const _ as usize },
        291usize,
        concat!(
            "Offset of field: ",
            stringify!(pfsync_state),
            "::",
            stringify!(proto_variant)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pfsync_state>())).__pad as *const _ as usize },
        292usize,
        concat!(
            "Offset of field: ",
            stringify!(pfsync_state),
            "::",
            stringify!(__pad)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pfsync_state>())).flowhash as *const _ as usize },
        293usize,
        concat!(
            "Offset of field: ",
            stringify!(pfsync_state),
            "::",
            stringify!(flowhash)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pf_rulequeue {
    pub tqh_first: *mut pf_rule,
    pub tqh_last: *mut *mut pf_rule,
}
#[test]
fn bindgen_test_layout_pf_rulequeue() {
    assert_eq!(
        ::std::mem::size_of::<pf_rulequeue>(),
        16usize,
        concat!("Size of: ", stringify!(pf_rulequeue))
    );
    assert_eq!(
        ::std::mem::align_of::<pf_rulequeue>(),
        8usize,
        concat!("Alignment of ", stringify!(pf_rulequeue))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pf_rulequeue>())).tqh_first as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_rulequeue),
            "::",
            stringify!(tqh_first)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pf_rulequeue>())).tqh_last as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_rulequeue),
            "::",
            stringify!(tqh_last)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pf_ruleset {
    pub rules: [pf_ruleset__bindgen_ty_1; 6usize],
    pub anchor: *mut pf_anchor,
    pub tticket: u_int32_t,
    pub tables: ::std::os::raw::c_int,
    pub topen: ::std::os::raw::c_int,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pf_ruleset__bindgen_ty_1 {
    pub queues: [pf_rulequeue; 2usize],
    pub active: pf_ruleset__bindgen_ty_1__bindgen_ty_1,
    pub inactive: pf_ruleset__bindgen_ty_1__bindgen_ty_1,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pf_ruleset__bindgen_ty_1__bindgen_ty_1 {
    pub ptr: *mut pf_rulequeue,
    pub ptr_array: *mut *mut pf_rule,
    pub rcount: u_int32_t,
    pub ticket: u_int32_t,
    pub open: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_pf_ruleset__bindgen_ty_1__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<pf_ruleset__bindgen_ty_1__bindgen_ty_1>(),
        32usize,
        concat!(
            "Size of: ",
            stringify!(pf_ruleset__bindgen_ty_1__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<pf_ruleset__bindgen_ty_1__bindgen_ty_1>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(pf_ruleset__bindgen_ty_1__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<pf_ruleset__bindgen_ty_1__bindgen_ty_1>())).ptr as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_ruleset__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(ptr)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<pf_ruleset__bindgen_ty_1__bindgen_ty_1>())).ptr_array as *const _
                as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_ruleset__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(ptr_array)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<pf_ruleset__bindgen_ty_1__bindgen_ty_1>())).rcount as *const _
                as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_ruleset__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(rcount)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<pf_ruleset__bindgen_ty_1__bindgen_ty_1>())).ticket as *const _
                as usize
        },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_ruleset__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(ticket)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<pf_ruleset__bindgen_ty_1__bindgen_ty_1>())).open as *const _
                as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_ruleset__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(open)
        )
    );
}
#[test]
fn bindgen_test_layout_pf_ruleset__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<pf_ruleset__bindgen_ty_1>(),
        96usize,
        concat!("Size of: ", stringify!(pf_ruleset__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<pf_ruleset__bindgen_ty_1>(),
        8usize,
        concat!("Alignment of ", stringify!(pf_ruleset__bindgen_ty_1))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pf_ruleset__bindgen_ty_1>())).queues as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_ruleset__bindgen_ty_1),
            "::",
            stringify!(queues)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pf_ruleset__bindgen_ty_1>())).active as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_ruleset__bindgen_ty_1),
            "::",
            stringify!(active)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<pf_ruleset__bindgen_ty_1>())).inactive as *const _ as usize
        },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_ruleset__bindgen_ty_1),
            "::",
            stringify!(inactive)
        )
    );
}
#[test]
fn bindgen_test_layout_pf_ruleset() {
    assert_eq!(
        ::std::mem::size_of::<pf_ruleset>(),
        600usize,
        concat!("Size of: ", stringify!(pf_ruleset))
    );
    assert_eq!(
        ::std::mem::align_of::<pf_ruleset>(),
        8usize,
        concat!("Alignment of ", stringify!(pf_ruleset))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pf_ruleset>())).rules as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_ruleset),
            "::",
            stringify!(rules)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pf_ruleset>())).anchor as *const _ as usize },
        576usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_ruleset),
            "::",
            stringify!(anchor)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pf_ruleset>())).tticket as *const _ as usize },
        584usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_ruleset),
            "::",
            stringify!(tticket)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pf_ruleset>())).tables as *const _ as usize },
        588usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_ruleset),
            "::",
            stringify!(tables)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pf_ruleset>())).topen as *const _ as usize },
        592usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_ruleset),
            "::",
            stringify!(topen)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pf_anchor_node {
    pub rbh_root: *mut pf_anchor,
}
#[test]
fn bindgen_test_layout_pf_anchor_node() {
    assert_eq!(
        ::std::mem::size_of::<pf_anchor_node>(),
        8usize,
        concat!("Size of: ", stringify!(pf_anchor_node))
    );
    assert_eq!(
        ::std::mem::align_of::<pf_anchor_node>(),
        8usize,
        concat!("Alignment of ", stringify!(pf_anchor_node))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pf_anchor_node>())).rbh_root as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_anchor_node),
            "::",
            stringify!(rbh_root)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct pf_anchor {
    pub entry_global: pf_anchor__bindgen_ty_1,
    pub entry_node: pf_anchor__bindgen_ty_2,
    pub parent: *mut pf_anchor,
    pub children: pf_anchor_node,
    pub name: [::std::os::raw::c_char; 64usize],
    pub path: [::std::os::raw::c_char; 1024usize],
    pub ruleset: pf_ruleset,
    pub refcnt: ::std::os::raw::c_int,
    pub match_: ::std::os::raw::c_int,
    pub owner: [::std::os::raw::c_char; 64usize],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pf_anchor__bindgen_ty_1 {
    pub rbe_left: *mut pf_anchor,
    pub rbe_right: *mut pf_anchor,
    pub rbe_parent: *mut pf_anchor,
}
#[test]
fn bindgen_test_layout_pf_anchor__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<pf_anchor__bindgen_ty_1>(),
        24usize,
        concat!("Size of: ", stringify!(pf_anchor__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<pf_anchor__bindgen_ty_1>(),
        8usize,
        concat!("Alignment of ", stringify!(pf_anchor__bindgen_ty_1))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<pf_anchor__bindgen_ty_1>())).rbe_left as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_anchor__bindgen_ty_1),
            "::",
            stringify!(rbe_left)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<pf_anchor__bindgen_ty_1>())).rbe_right as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_anchor__bindgen_ty_1),
            "::",
            stringify!(rbe_right)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<pf_anchor__bindgen_ty_1>())).rbe_parent as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_anchor__bindgen_ty_1),
            "::",
            stringify!(rbe_parent)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pf_anchor__bindgen_ty_2 {
    pub rbe_left: *mut pf_anchor,
    pub rbe_right: *mut pf_anchor,
    pub rbe_parent: *mut pf_anchor,
}
#[test]
fn bindgen_test_layout_pf_anchor__bindgen_ty_2() {
    assert_eq!(
        ::std::mem::size_of::<pf_anchor__bindgen_ty_2>(),
        24usize,
        concat!("Size of: ", stringify!(pf_anchor__bindgen_ty_2))
    );
    assert_eq!(
        ::std::mem::align_of::<pf_anchor__bindgen_ty_2>(),
        8usize,
        concat!("Alignment of ", stringify!(pf_anchor__bindgen_ty_2))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<pf_anchor__bindgen_ty_2>())).rbe_left as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_anchor__bindgen_ty_2),
            "::",
            stringify!(rbe_left)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<pf_anchor__bindgen_ty_2>())).rbe_right as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_anchor__bindgen_ty_2),
            "::",
            stringify!(rbe_right)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<pf_anchor__bindgen_ty_2>())).rbe_parent as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_anchor__bindgen_ty_2),
            "::",
            stringify!(rbe_parent)
        )
    );
}
#[test]
fn bindgen_test_layout_pf_anchor() {
    assert_eq!(
        ::std::mem::size_of::<pf_anchor>(),
        1824usize,
        concat!("Size of: ", stringify!(pf_anchor))
    );
    assert_eq!(
        ::std::mem::align_of::<pf_anchor>(),
        8usize,
        concat!("Alignment of ", stringify!(pf_anchor))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pf_anchor>())).entry_global as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_anchor),
            "::",
            stringify!(entry_global)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pf_anchor>())).entry_node as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_anchor),
            "::",
            stringify!(entry_node)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pf_anchor>())).parent as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_anchor),
            "::",
            stringify!(parent)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pf_anchor>())).children as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_anchor),
            "::",
            stringify!(children)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pf_anchor>())).name as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_anchor),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pf_anchor>())).path as *const _ as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_anchor),
            "::",
            stringify!(path)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pf_anchor>())).ruleset as *const _ as usize },
        1152usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_anchor),
            "::",
            stringify!(ruleset)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pf_anchor>())).refcnt as *const _ as usize },
        1752usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_anchor),
            "::",
            stringify!(refcnt)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pf_anchor>())).match_ as *const _ as usize },
        1756usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_anchor),
            "::",
            stringify!(match_)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pf_anchor>())).owner as *const _ as usize },
        1760usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_anchor),
            "::",
            stringify!(owner)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pf_status {
    pub counters: [u_int64_t; 16usize],
    pub lcounters: [u_int64_t; 7usize],
    pub fcounters: [u_int64_t; 3usize],
    pub scounters: [u_int64_t; 3usize],
    pub pcounters: [[[u_int64_t; 3usize]; 2usize]; 2usize],
    pub bcounters: [[u_int64_t; 2usize]; 2usize],
    pub stateid: u_int64_t,
    pub running: u_int32_t,
    pub states: u_int32_t,
    pub src_nodes: u_int32_t,
    pub since: u_int64_t,
    pub debug: u_int32_t,
    pub hostid: u_int32_t,
    pub ifname: [::std::os::raw::c_char; 16usize],
    pub pf_chksum: [u_int8_t; 16usize],
}
#[test]
fn bindgen_test_layout_pf_status() {
    assert_eq!(
        ::std::mem::size_of::<pf_status>(),
        432usize,
        concat!("Size of: ", stringify!(pf_status))
    );
    assert_eq!(
        ::std::mem::align_of::<pf_status>(),
        8usize,
        concat!("Alignment of ", stringify!(pf_status))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pf_status>())).counters as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_status),
            "::",
            stringify!(counters)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pf_status>())).lcounters as *const _ as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_status),
            "::",
            stringify!(lcounters)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pf_status>())).fcounters as *const _ as usize },
        184usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_status),
            "::",
            stringify!(fcounters)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pf_status>())).scounters as *const _ as usize },
        208usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_status),
            "::",
            stringify!(scounters)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pf_status>())).pcounters as *const _ as usize },
        232usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_status),
            "::",
            stringify!(pcounters)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pf_status>())).bcounters as *const _ as usize },
        328usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_status),
            "::",
            stringify!(bcounters)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pf_status>())).stateid as *const _ as usize },
        360usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_status),
            "::",
            stringify!(stateid)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pf_status>())).running as *const _ as usize },
        368usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_status),
            "::",
            stringify!(running)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pf_status>())).states as *const _ as usize },
        372usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_status),
            "::",
            stringify!(states)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pf_status>())).src_nodes as *const _ as usize },
        376usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_status),
            "::",
            stringify!(src_nodes)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pf_status>())).since as *const _ as usize },
        384usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_status),
            "::",
            stringify!(since)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pf_status>())).debug as *const _ as usize },
        392usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_status),
            "::",
            stringify!(debug)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pf_status>())).hostid as *const _ as usize },
        396usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_status),
            "::",
            stringify!(hostid)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pf_status>())).ifname as *const _ as usize },
        400usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_status),
            "::",
            stringify!(ifname)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pf_status>())).pf_chksum as *const _ as usize },
        416usize,
        concat!(
            "Offset of field: ",
            stringify!(pf_status),
            "::",
            stringify!(pf_chksum)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct pfioc_pooladdr {
    pub action: u_int32_t,
    pub ticket: u_int32_t,
    pub nr: u_int32_t,
    pub r_num: u_int32_t,
    pub r_action: u_int8_t,
    pub r_last: u_int8_t,
    pub af: u_int8_t,
    pub anchor: [::std::os::raw::c_char; 1024usize],
    pub addr: pf_pooladdr,
}
#[test]
fn bindgen_test_layout_pfioc_pooladdr() {
    assert_eq!(
        ::std::mem::size_of::<pfioc_pooladdr>(),
        1136usize,
        concat!("Size of: ", stringify!(pfioc_pooladdr))
    );
    assert_eq!(
        ::std::mem::align_of::<pfioc_pooladdr>(),
        8usize,
        concat!("Alignment of ", stringify!(pfioc_pooladdr))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pfioc_pooladdr>())).action as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pfioc_pooladdr),
            "::",
            stringify!(action)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pfioc_pooladdr>())).ticket as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(pfioc_pooladdr),
            "::",
            stringify!(ticket)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pfioc_pooladdr>())).nr as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(pfioc_pooladdr),
            "::",
            stringify!(nr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pfioc_pooladdr>())).r_num as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(pfioc_pooladdr),
            "::",
            stringify!(r_num)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pfioc_pooladdr>())).r_action as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(pfioc_pooladdr),
            "::",
            stringify!(r_action)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pfioc_pooladdr>())).r_last as *const _ as usize },
        17usize,
        concat!(
            "Offset of field: ",
            stringify!(pfioc_pooladdr),
            "::",
            stringify!(r_last)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pfioc_pooladdr>())).af as *const _ as usize },
        18usize,
        concat!(
            "Offset of field: ",
            stringify!(pfioc_pooladdr),
            "::",
            stringify!(af)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pfioc_pooladdr>())).anchor as *const _ as usize },
        19usize,
        concat!(
            "Offset of field: ",
            stringify!(pfioc_pooladdr),
            "::",
            stringify!(anchor)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pfioc_pooladdr>())).addr as *const _ as usize },
        1048usize,
        concat!(
            "Offset of field: ",
            stringify!(pfioc_pooladdr),
            "::",
            stringify!(addr)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct pfioc_rule {
    pub action: u_int32_t,
    pub ticket: u_int32_t,
    pub pool_ticket: u_int32_t,
    pub nr: u_int32_t,
    pub anchor: [::std::os::raw::c_char; 1024usize],
    pub anchor_call: [::std::os::raw::c_char; 1024usize],
    pub rule: pf_rule,
}
#[test]
fn bindgen_test_layout_pfioc_rule() {
    assert_eq!(
        ::std::mem::size_of::<pfioc_rule>(),
        3104usize,
        concat!("Size of: ", stringify!(pfioc_rule))
    );
    assert_eq!(
        ::std::mem::align_of::<pfioc_rule>(),
        8usize,
        concat!("Alignment of ", stringify!(pfioc_rule))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pfioc_rule>())).action as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pfioc_rule),
            "::",
            stringify!(action)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pfioc_rule>())).ticket as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(pfioc_rule),
            "::",
            stringify!(ticket)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pfioc_rule>())).pool_ticket as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(pfioc_rule),
            "::",
            stringify!(pool_ticket)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pfioc_rule>())).nr as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(pfioc_rule),
            "::",
            stringify!(nr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pfioc_rule>())).anchor as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(pfioc_rule),
            "::",
            stringify!(anchor)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pfioc_rule>())).anchor_call as *const _ as usize },
        1040usize,
        concat!(
            "Offset of field: ",
            stringify!(pfioc_rule),
            "::",
            stringify!(anchor_call)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pfioc_rule>())).rule as *const _ as usize },
        2064usize,
        concat!(
            "Offset of field: ",
            stringify!(pfioc_rule),
            "::",
            stringify!(rule)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct pfioc_state_addr_kill {
    pub addr: pf_addr_wrap,
    pub reserved_: [u_int8_t; 3usize],
    pub neg: u_int8_t,
    pub xport: pf_rule_xport,
}
#[test]
fn bindgen_test_layout_pfioc_state_addr_kill() {
    assert_eq!(
        ::std::mem::size_of::<pfioc_state_addr_kill>(),
        64usize,
        concat!("Size of: ", stringify!(pfioc_state_addr_kill))
    );
    assert_eq!(
        ::std::mem::align_of::<pfioc_state_addr_kill>(),
        8usize,
        concat!("Alignment of ", stringify!(pfioc_state_addr_kill))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pfioc_state_addr_kill>())).addr as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pfioc_state_addr_kill),
            "::",
            stringify!(addr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pfioc_state_addr_kill>())).reserved_ as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(pfioc_state_addr_kill),
            "::",
            stringify!(reserved_)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pfioc_state_addr_kill>())).neg as *const _ as usize },
        51usize,
        concat!(
            "Offset of field: ",
            stringify!(pfioc_state_addr_kill),
            "::",
            stringify!(neg)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pfioc_state_addr_kill>())).xport as *const _ as usize },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(pfioc_state_addr_kill),
            "::",
            stringify!(xport)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct pfioc_state_kill {
    pub psk_af: sa_family_t,
    pub psk_proto: u_int8_t,
    pub psk_proto_variant: u_int8_t,
    pub _pad: u_int8_t,
    pub psk_src: pfioc_state_addr_kill,
    pub psk_dst: pfioc_state_addr_kill,
    pub psk_ifname: [::std::os::raw::c_char; 16usize],
    pub psk_ownername: [::std::os::raw::c_char; 64usize],
}
#[test]
fn bindgen_test_layout_pfioc_state_kill() {
    assert_eq!(
        ::std::mem::size_of::<pfioc_state_kill>(),
        216usize,
        concat!("Size of: ", stringify!(pfioc_state_kill))
    );
    assert_eq!(
        ::std::mem::align_of::<pfioc_state_kill>(),
        8usize,
        concat!("Alignment of ", stringify!(pfioc_state_kill))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pfioc_state_kill>())).psk_af as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pfioc_state_kill),
            "::",
            stringify!(psk_af)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pfioc_state_kill>())).psk_proto as *const _ as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(pfioc_state_kill),
            "::",
            stringify!(psk_proto)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<pfioc_state_kill>())).psk_proto_variant as *const _ as usize
        },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(pfioc_state_kill),
            "::",
            stringify!(psk_proto_variant)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pfioc_state_kill>()))._pad as *const _ as usize },
        3usize,
        concat!(
            "Offset of field: ",
            stringify!(pfioc_state_kill),
            "::",
            stringify!(_pad)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pfioc_state_kill>())).psk_src as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(pfioc_state_kill),
            "::",
            stringify!(psk_src)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pfioc_state_kill>())).psk_dst as *const _ as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(pfioc_state_kill),
            "::",
            stringify!(psk_dst)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pfioc_state_kill>())).psk_ifname as *const _ as usize },
        136usize,
        concat!(
            "Offset of field: ",
            stringify!(pfioc_state_kill),
            "::",
            stringify!(psk_ifname)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pfioc_state_kill>())).psk_ownername as *const _ as usize },
        152usize,
        concat!(
            "Offset of field: ",
            stringify!(pfioc_state_kill),
            "::",
            stringify!(psk_ownername)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct pfioc_states {
    pub ps_len: ::std::os::raw::c_int,
    pub ps_u: pfioc_states__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union pfioc_states__bindgen_ty_1 {
    pub psu_buf: caddr_t,
    pub psu_states: *mut pfsync_state,
    _bindgen_union_align: u64,
}
#[test]
fn bindgen_test_layout_pfioc_states__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<pfioc_states__bindgen_ty_1>(),
        8usize,
        concat!("Size of: ", stringify!(pfioc_states__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<pfioc_states__bindgen_ty_1>(),
        8usize,
        concat!("Alignment of ", stringify!(pfioc_states__bindgen_ty_1))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<pfioc_states__bindgen_ty_1>())).psu_buf as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pfioc_states__bindgen_ty_1),
            "::",
            stringify!(psu_buf)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<pfioc_states__bindgen_ty_1>())).psu_states as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pfioc_states__bindgen_ty_1),
            "::",
            stringify!(psu_states)
        )
    );
}
#[test]
fn bindgen_test_layout_pfioc_states() {
    assert_eq!(
        ::std::mem::size_of::<pfioc_states>(),
        16usize,
        concat!("Size of: ", stringify!(pfioc_states))
    );
    assert_eq!(
        ::std::mem::align_of::<pfioc_states>(),
        8usize,
        concat!("Alignment of ", stringify!(pfioc_states))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pfioc_states>())).ps_len as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pfioc_states),
            "::",
            stringify!(ps_len)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pfioc_states>())).ps_u as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(pfioc_states),
            "::",
            stringify!(ps_u)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pfioc_trans {
    pub size: ::std::os::raw::c_int,
    pub esize: ::std::os::raw::c_int,
    pub array: *mut pfioc_trans_pfioc_trans_e,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct pfioc_trans_pfioc_trans_e {
    pub rs_num: ::std::os::raw::c_int,
    pub anchor: [::std::os::raw::c_char; 1024usize],
    pub ticket: u_int32_t,
}
#[test]
fn bindgen_test_layout_pfioc_trans_pfioc_trans_e() {
    assert_eq!(
        ::std::mem::size_of::<pfioc_trans_pfioc_trans_e>(),
        1032usize,
        concat!("Size of: ", stringify!(pfioc_trans_pfioc_trans_e))
    );
    assert_eq!(
        ::std::mem::align_of::<pfioc_trans_pfioc_trans_e>(),
        4usize,
        concat!("Alignment of ", stringify!(pfioc_trans_pfioc_trans_e))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<pfioc_trans_pfioc_trans_e>())).rs_num as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pfioc_trans_pfioc_trans_e),
            "::",
            stringify!(rs_num)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<pfioc_trans_pfioc_trans_e>())).anchor as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(pfioc_trans_pfioc_trans_e),
            "::",
            stringify!(anchor)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<pfioc_trans_pfioc_trans_e>())).ticket as *const _ as usize
        },
        1028usize,
        concat!(
            "Offset of field: ",
            stringify!(pfioc_trans_pfioc_trans_e),
            "::",
            stringify!(ticket)
        )
    );
}
#[test]
fn bindgen_test_layout_pfioc_trans() {
    assert_eq!(
        ::std::mem::size_of::<pfioc_trans>(),
        16usize,
        concat!("Size of: ", stringify!(pfioc_trans))
    );
    assert_eq!(
        ::std::mem::align_of::<pfioc_trans>(),
        8usize,
        concat!("Alignment of ", stringify!(pfioc_trans))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pfioc_trans>())).size as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pfioc_trans),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pfioc_trans>())).esize as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(pfioc_trans),
            "::",
            stringify!(esize)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pfioc_trans>())).array as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(pfioc_trans),
            "::",
            stringify!(array)
        )
    );
}
